# data = [100,200,300]
# print(data)
# print(type(data))
# print(data[0])
# 연습) 0~9사이의 수를 입력받아 한글표기식 출력하는 프로그램을 list를 이용하여 작성 해 봅니다.
# kor = ["영","일","이","삼","사","오","육","칠","팔","구"];
# n = int(input("0~9사이의 수를 입력==>"))
# print(kor[n])

# 연습) 0~99사이의 수를 입력받아 한글표기식 출력하는 프로그램을 작성 해 봅니다.
kor10 = ["","십","이십","삼십","사십","오십","육십","칠십","팔십","구십"];
kor1 = ["","일","이","삼","사","오","육","칠","팔","구"]
n = int(input("0~99사이의 수를 입력"))
n10= n // 10
n1 = n % 10
if 0<= n <= 99:
    if n == 0:
        kor = "영"
    else:
        kor = kor10[n10] + kor1[n1]
    print(kor)
else:
    print("입력범위를 넘었습니다.")